messages = {
    'ru': {
        'welcome': "Добро пожаловать в Alaia Tours! 🌍✈️\n\nМы — команда, нацеленная на развитие туризма в Кыргызстане. 🏞️ Мы активно запускаем наш проект, направленный на создание удобного ресурса для путешественников. 📱🌏"
    },
    'en': {
        'welcome': "Welcome to Alaia Tours! 🌍✈️\n\nWe are a team focused on the development of tourism in Kyrgyzstan. 🏞️ We are actively launching our project aimed at creating a convenient resource for travelers. 📱🌏"
    },
    'kgz': {
        'welcome': "Alaia Tours командасына кош келиңиз! 🌍✈️\n\nБиз Кыргызстанда туризмди өнүктүрүүгө багытталганбыз. 🏞️ Биз саякатчылар үчүн ыңгайлуу ресурстарды түзүүгө багытталган долбоорду активдүү ишке киргизүүдөбүз. 📱🌏"
    }
}

button_texts = {
    'ru': {
        'select_language': 'Сменить язык',
        'return_menu': "🔙 Вернуться в главное меню",
        'ai_help': 'Чат с ИИ',
    },
    'kgz': {
        'select_language': 'Тилди алмаштырыңыз',
        'return_menu': "🔙 Башкы менюга кайтуу",
        'ai_help': 'ИИ менен суйлошуу',
    },
    'en': {
        'select_language': 'Change Language',
        'return_menu': "🔙 Return to Main Menu",
        'ai_help': 'AI Assistance',
    },
}
chat_messages = {
    'ru': {
        'ai_help_message': "Мы готовы помочь вам! Напишите название города или места, о котором вы хотите узнать.",
        'request_canceled': "Ваш запрос был отменен.",
        'cancel': "Отменить",
        'ai_help': "Пожалуйста, отправьте свой запрос.",
        'city_info': "Вот информация о вашем запросе: {city}. В {city} вы можете посетить лучшие места для отдыха: [ссылки на места].",
        'city_not_found': "Извините, информация о таком месте не найдена.",
    },
    'kgz': {
        'ai_help_message': "Биз сизге жардам берүүгө даярбыз! Суранычыңызды жазыңыз, кайсы шаарды же жайды билгиңиз келсе.",
        'request_canceled': "Суранычыңыз жокко чыгарылды.",
        'cancel': "Жокко чыгаруу",
        'ai_help': "Суранычыңызды жөнөтүңүз.",
        'city_info': "Бул жерге маалымат: {city}. {city} шаарында дем алыш үчүн мыкты жерлерди көрө аласыз: [жерлерге шилтемелер].",
        'city_not_found': "Кечиресиз, мындай жер боюнча маалымат табылбады.",
    },
    'en': {
        'ai_help_message': "We are ready to assist you! Please write the name of the city or place you'd like to know about.",
        'request_canceled': "Your request has been canceled.",
        'cancel': "Cancel",
        'ai_help': "Please submit your query.",
        'city_info': "Here is the information about your query: {city}. In {city}, you can visit the best places for recreation: [links to places].",
        'city_not_found': "Sorry, no information found for this place.",
    }
}
cancel = {
    'ru': "❌ Отменить",
    'kgz': "❌ Жокко чыгаруу",
    'en': "❌ Cancel"
}